public class Main {
    public static void main(String[] args) {
        String s = "\n" +
                "Ривз, Киану\n" +
                "Материал из Википедии — свободной энциклопедии\n" +
                "Перейти к навигацииПерейти к поиску\n" +
                "В Википедии есть статьи о других людях с фамилией Ривз.\n" +
                "Киану Ривз\n" +
                "англ. Keanu Reeves\n" +
                "Киану Ривз в 2019 году\n" +
                "Киану Ривз в 2019 году\n" +
                "Имя при рождении\tКиану Чарльз Ривз\n" +
                "Дата рождения\t2 сентября 1964[1][2][3][…] (56 лет)\n" +
                "Место рождения\t\n" +
                "Бейрут, Бейрут, Ливан\n" +
                "Гражданство\t Канада\n" +
                "Профессия\t\n" +
                "актёр, кинопродюсер, музыкант, бас-гитарист\n" +
                "Карьера\t1984 — н. в.\n" +
                "Награды\t\n" +
                "Кинонаграда MTV за лучшую актёрскую команду (1995)\n" +
                "\n" +
                "Кинонаграда MTV самому желанному мужчине[d] (1992)\n" +
                "\n" +
                "Кинонаграда MTV за лучшую мужскую роль[d] (2000)\n" +
                "\n" +
                "IMDb\tID 0000206\n" +
                "Commons-logo.svg Медиафайлы на Викискладе\n" +
                "Киа́ну Чарльз Ривз (англ. Keanu Charles Reeves, [kiˈɑːnuː]; род. 2 сентября 1964, Бейрут, Ливан) — канадский актёр, кинорежиссёр, кинопродюсер и музыкант (бас-гитарист). Наиболее известен своими ролями в киносериях «Матрица» (1999—2021), «Билл и Тед» (англ.)русск. (1989—2020) и «Джон Уик» (2014—2019), а также в фильмах «На гребне волны» (1991), «Мой личный штат Айдахо» (1991), «Дракула» (1992), «Скорость» (1994), «Джонни-мнемоник» (1995), «Адвокат дьявола» (1997), «Константин: Повелитель тьмы» (2005) и «Короли улиц» (2008).\n" +
                "\n" +
                "Ривз работал с такими известными кинорежиссёрами, как Стивен Фрирз («Опасные связи», 1988), Гас Ван Сент («Мой личный штат Айдахо», 1991), Фрэнсис Форд Коппола («Дракула», 1992) и Бернардо Бертолуччи («Маленький Будда», 1993). В 2013 году сам дебютировал в качестве режиссёра, сняв фильм о боевых искусствах «Мастер тай-цзи».\n" +
                "\n" +
                "Ссылаясь на его игру в фильме «На гребне волны» (1991), критик газеты The New York Times Джанет Маслин хвалит актёрскую многосторонность Ривза, говоря, что он «проявляет значительную дисциплину и диапазон. Он легко перемещается между выдержанным поведением, подходящим для полицейско-процедурной истории, и гибкой манерой его комических ролей»[4].\n" +
                "\n" +
                "31 января 2005 года Киану Ривз получил звезду на голливудской «Аллее славы»[5]. Является самым высокооплачиваемым актёром (англ.)русск. в истории кинематографа по соотношению суммы разового гонорара к совокупной сумме заработка ($30 к $156 млн).\n" +
                "\n" +
                "\n" +
                "Содержание\n" +
                "1\tБиография и творчество\n" +
                "1.1\tДетство и юность\n" +
                "1.2\tКарьера\n" +
                "1.2.1\t1980-е годы\n" +
                "1.2.2\t1990-е\n" +
                "1.2.3\t2000-е\n" +
                "1.2.4\t2010-е\n" +
                "1.2.5\t2020-е\n" +
                "1.3\tДругие проекты\n" +
                "1.4\tМузыка\n" +
                "2\tЛичная жизнь\n" +
                "3\tФильмография\n" +
                "3.1\tКомпьютерные игры\n" +
                "3.2\tЗа кадром\n" +
                "4\tНаграды и номинации\n" +
                "4.1\tНаграды\n" +
                "4.2\tНоминации\n" +
                "4.3\tАнтипремия\n" +
                "5\tПримечания\n" +
                "6\tСсылки\n" +
                "Биография и творчество\n" +
                "Детство и юность\n" +
                "Киану Ривз родился в Бейруте, столице Ливана, в семье англичанки Патрисии Бонд (в девичестве — Тейлор) и уроженца Гавайев Сэмьюэла Ноулина Ривза-младшего, американца с английскими, ирландскими, португальскими, гавайскими и китайскими корнями[6]. Патрисия познакомилась с Сэмьюэлом в Бейруте, где работала. Он был тогда неквалифицированным рабочим, аттестат зрелости получил, отбывая срок заключения на Гавайях, будучи осужденным по обвинению в продаже героина в аэропорту. В дальнейшем приобрел специальность геолога. Он бросил свою жену и семью, когда их сыну было три года. В настоящее время[уточнить] Ривз не поддерживает отношений с отцом.\n" +
                "\n" +
                "В детстве Ривзу часто приходилось менять место жительства, переезжая вместе с матерью[7], которая после развода в 1966 году стала художником по костюмам. Сначала они перебрались в Австралию, затем в Нью-Йорк. Там его мать познакомилась с бродвейским и голливудским режиссёром Полом Аароном и вышла за него замуж. Семья переехала в Торонто; пара развелась в 1971 году. В 1976 году Патрисия вышла замуж за Роберта Миллера, рок-промоутера; они развелись в 1980 году. Брак с четвёртым мужем, парикмахером Джеком Бондом, закончился в 1994 году.\n" +
                "\n" +
                "Детство и юность Ривза и его сестёр по большей части прошли в Торонто. Его воспитанием в основном занимались родители матери и няньки. В течение пяти лет он сменил четыре школы, включая школу искусств в Торонто, откуда он был позднее исключён «из-за излишней непокорности», как он сам объяснял позднее.\n" +
                "\n" +
                "Ривз больше преуспевал в хоккее, нежели в академических дисциплинах, поскольку процесс образования был осложнен для него дислексией. Ривз мечтал стать хоккеистом, выступающим за честь Канады на Олимпиаде, однако травма поставила на его мечтах о хоккее крест. Позднее Киану посещал альтернативную бесплатную школу («Avondale Alternative»), что позволяло ему получать образование и подрабатывать в качестве актёра одновременно. Позже он бросил школу, так и не получив аттестат о среднем образовании.\n" +
                "\n" +
                "Карьера\n" +
                "1980-е годы\n" +
                "Ривз начал свою актёрскую карьеру в возрасте девяти лет, появившись в театральной постановке мюзикла «Чёртовы янки». В пятнадцать лет он сыграл роль Меркуцио в театральной постановке «Ромео и Джульетты». Дебют Ривза на экране состоялся на канадском телеканале CBC в одном из комедийных сериалов. В начале 1980-х годов он снимался в рекламных роликах, включая ролик для Кока-Колы, короткометражных фильмах, а также появлялся на театральной сцене в Торонто. В 1984 году работал корреспондентом в юношеской программе на CBC.\n" +
                "\n" +
                "Первым появлением Ривза в полнометражном фильме стала роль хоккейного вратаря в фильме «Молодая кровь» с Робом Лоу в главной роли. Затем Ривз отправился в Лос-Анджелес, после того как его бывший отчим Пол Аарон, театральный и телевизионный режиссёр, убедил кинопродюсера Эрвина Стоффа стать менеджером и агентом Киану. Стофф является менеджером Ривза по сей день, он принимал участие в продюсировании многих его фильмов.\n" +
                "\n" +
                "После нескольких маленьких ролей Ривз получил более заметную роль в драме 1986 года «На берегу реки», основанной на реальных событиях и повествующей о душевных страданиях и муках совести в группе подростков, причиной которых стало убийство их подруги одним из них. После успеха этого фильма среди кинокритиков Ривз провёл конец 1980-х снимаясь в фильмах, ориентированных на подростковую аудиторию. Среди них — драма 1988 года «Вечная песня», научно-фантастический фильм 1989 года «Невероятные приключения Билла и Теда» и его сиквел 1991 года — «Новые приключения Билла и Теда». Представление Ривза в прессе и отклики по поводу его актёрского мастерства в начале 1990-х годов были сильно ассоциированы с образом легкомысленного Теда.\n" +
                "\n" +
                "1990-е\n" +
                "В начале 1990-х Ривз начинает отмежёвываться от образа актёра, снимающегося в фильмах для подростков. Он появляется в высокобюджетных фильмах. Так, за роль в боевике «На гребне волны» (1991) он получает награду MTV в номинации «Самый желанный актёр» в 1992 году. Кроме этого, Ривз появляется в различных низкобюджетных, независимых фильмах, включая драму «Мой личный штат Айдахо» (1991), где он снялся вместе со своим близким другом Ривером Фениксом. Также сыграл в фильме Фрэнсиса Форда Копполы «Дракула» (1992).\n" +
                "\n" +
                "В 1994 году кинокарьера Киану Ривза достигла новой высоты, благодаря его роли в боевике «Скорость». Участие Ривза в этом фильме вызвало споры среди критиков, поскольку, за исключением фильма «На гребне волны», он был известен преимущественно как актёр комедий и независимых драм. До этого Ривз никогда не был единственным главным персонажем в кинокартине. Летний боевик имел достаточно большой бюджет и был снят перепрофилировавшимся кинооператором, начинающим кинорежиссёром Яном де Бонтом. Неожиданный международный успех фильма сделал Ривза и его партнёршу по фильму Сандру Буллок звёздами первой величины.\n" +
                "\n" +
                "Несмотря на свои успехи в блокбастерах, Ривз продолжал принимать предложения о второстепенных ролях и появляться в экспериментальном кино. Его главная роль в романтической драме 1995 года «Прогулка в облаках» стала хитом. Он ошеломил прессу, отказавшись играть в «Скорости 2» и выбрав главную роль в театральной постановке «Гамлета» в Виннипеге. Роджер Льюис, критик «The Sunday Times», писал по поводу его игры: «Он вполне воплотил наивность, великолепную ярость, животное изящество на дрожжах, эмоциональное насилие, эту форму Принца Датского… Он является одним из трёх главных Гамлетов, которых я когда-либо видел, — по одной простой причине: он и есть Гамлет».\n" +
                "\n" +
                "Роли Ривза после «Прогулки в облаках» тем не менее оказались провальными и с точки зрения кинокритиков, и с точки зрения популярности. Такие высокобюджетные фильмы, как фантастический фильм 1995 года «Джонни-мнемоник» и триллер 1996 года «Цепная реакция» подверглись резкой критике и провалились в прокате. Независимые фильмы, такие, как «Чувствуя Миннесоту» (1996), также оказались неудачей с точки зрения критиков.\n" +
                "\n" +
                "Карьера Ривза стала оправляться от неудач после его участия в мистической драме «Адвокат дьявола» (1997) вместе с Аль Пачино и Шарлиз Терон. Ривз согласился на занижение собственного гонорара за этот фильм ради привлечения к фильму Пачино, то же самое он сделает и в менее успешных «Дублёрах» (2000) ради участия Джина Хэкмана. Несмотря на то, что «Адвокат дьявола» имел кассовый успех, получил хорошие рецензии и доказал, что Ривз может играть взрослого карьериста, многие критики отметили, что его плохая игра умалила приятное впечатление от фильма. Напротив, научно-фантастический боевик 1999 года «Матрица», в котором Ривз сыграл главную роль, принёс кассовый успех и получил положительные рецензии.\n" +
                "Сначала хотел стать хоккеистом. Я был застенчивым ребёнком. Уверенно чувствовал себя лишь на льду. А потом вдруг снялся в нескольких рекламных роликах, только и всего. Хотел заработать лишних деньжат.\n" +
                "\n" +
                "— Киану Ривз\n" +
                "2000-е\n" +
                "\n" +
                "Звезда Киану Ривза на голливудской «Аллее славы»\n" +
                "В промежутках между «Матрицей» и её двумя продолжениями Ривз успел получить положительные отзывы за свою игру мужа-насильника в мистическом триллере «Дар» (2000). Кроме этого, Ривз появился в нескольких фильмах, заслуживших скорее негативные отзывы и небольшие кассовые сборы («Наблюдатель» (2000), «Дублёры» (2000), «Сладкий ноябрь» (2001)). Тем не менее, два сиквела «Матрицы», «Матрица: Перезагрузка» (2003) и «Матрица: Революция» (2003), комедийная мелодрама «Любовь по правилам и без» (2003) и мистический триллер «Константин» (2005) оказались коммерчески успешными и вернули Ривза в центр внимания публики.\n" +
                "\n" +
                "\n" +
                "2006 год\n" +
                "Его игра в фильме 2006 года «Помутнение», основанном на мрачном фантастическом романе Филипа Киндреда Дика, получила благосклонные отзывы, а также картина «Дом у озера», его совместная с Сандрой Буллок драма, довольно успешно окупившаяся в прокате.\n" +
                "\n" +
                "Он продолжил играть главные роли в двух последующих фильмах 2008 года — «Короли улиц» и «День, когда Земля остановилась». В феврале 2009 года на Берлинале публике был представлен фильм с участием Ривза — «Частная жизнь Пиппы Ли».\n" +
                "\n" +
                "2010-е\n" +
                "Ривз начал работать в качестве продюсера и актёра над сюрреалистической романтической комедией «Криминальная фишка от Генри» в декабре 2009 года, закончив её в начале 2010 года. После он начал работу в таком же качестве над научно-фантастической драмой «Пассажиры»[8].\n" +
                "\n" +
                "В январе 2009 года было объявлено, что Ривз будет сниматься в адаптации аниме-сериала «Ковбой Бибоп»[9][10]. Киану принял участие в самурайском фильме «47 ронинов».\n" +
                "\n" +
                "5 июля 2013 года в Китае состоялась премьера фильма «Мастер тай-цзи». Это был режиссёрский дебют Киану Ривза.\n" +
                "\n" +
                "\n" +
                "2015 год\n" +
                "Киану Ривз сыграл главную роль в психологическом хоррор-триллере Элая Рота «Кто там». Весной 2015 года Ривз приступил к работе над фильмом Николаса Виндинга Рефна «Неоновый демон»[11]; фильм вышел в мировой прокат весной 2016 года.\n" +
                "\n" +
                "В 2014 году Киану сыграл главную роль в фильме «Джон Уик»[12], в 2017 вышла вторая часть — «Джон Уик 2»[13], а в 2019 третья — «Джон Уик 3». Все три фильма получили хорошие отзывы критиков. Киану принял участие в третьем фильме из серии «Приключений Билла и Теда»[14].\n" +
                "\n" +
                "В ходе E3 2019 огласил дату выхода игры Cyberpunk 2077 — 16 апреля 2020 года, — при этом представ в новом трейлере игры в роли одного из ключевых персонажей[15]. Во время выступления один из зрителей выкрикнул ему: «Ты и сам сногсшибательный!» (англ. You're breathtaking), на что Киану ответил тем же прилагательным не только зрителю, но и всем в зале[16]. После этого инцидента аккаунт Cyberpunk 2077 в Твиттере пообещал подарить тому игроку коллекционное издание игры[17].\n" +
                "\n" +
                "2020-е\n" +
                "В феврале 2020 года в Сан-Франциско начались съёмки четвёртого фильма серии «Матрица», в котором Ривз снова исполнил роль Нео. Режиссёром картины выступила Лана Вачовски, снявшая три предыдущих фильма вместе со своей сестрой Лилли[18].\n" +
                "\n" +
                "Другие проекты\n" +
                "Основал студию Company Films вместе со Стивеном Хеймелом, студия занимается разработкой идей и сценариев, в том числе для фильма «Пассажиры».\n" +
                "\n" +
                "В 2011 году Киану Ривз совместно с механиком Гардом Холлингером из мастерской L.A. County Choprods основал компанию Arch Motorcycle по производству мотоциклов[19].\n" +
                "\n" +
                "Музыка\n" +
                "Ривз играл на бас-гитаре в альтернативной рок-группе Dogstar (англ.)русск.[20] в 1990-х. В 2000-х он выступал вместе с гранж группой Becky[21].\n" +
                "\n" +
                "Также он снялся в клипе Полы Абдул на песню «Rush Rush».\n" +
                "\n" +
                "Личная жизнь\n" +
                "\n" +
                "2014 год\n" +
                "Около девяти лет с начала своей звёздной карьеры Ривз предпочитал жить в съёмных домах и отелях. Он достаточно долго был постояльцем известного калифорнийского отеля «Шато Мармон». Ривз купил свой первый дом в лос-анджелесском районе Голливуд Хиллз примерно в 2003 году. У него также имеется квартира в районе Центрального парка в Нью-Йорке.\n" +
                "\n" +
                "Ривз никогда не был женат[22]. В декабре 1999 года у него и его подруги, киноактрисы Дженнифер Сайм, родилась мёртворождённая дочь, Ава Арчер Сайм-Ривз. Сайм погибла в автокатастрофе в апреле 2001 года в Лос-Анджелесе[23][24]. В ноябре 2019 года стало известно о новых отношениях Ривза с художницей и скульптором Александрой Грант, которая младше его на 9 лет[25].\n" +
                "\n" +
                "В 2008 году на Ривза подал в суд папарацци Элисон Силва. Силва требовал выплатить ему 711 974 доллара за побои и травмы, которые актёр якобы нанёс ему[26][27]. Судебная тяжба с папарацци длилась полтора года, в течение которых Силва продолжал атаковать Ривза и требовать выплат. На суде всем двенадцати присяжным заседателям понадобился всего час обсуждения, чтобы вынести вердикт и единогласно отклонить иск. Ривз был полностью оправдан[28].\n" +
                "\n" +
                "Хоть Киану Ривз и попал в список «Известные атеисты»[29][30], он неоднократно говорил о вере в Бога или другие высшие силы[31]. Киану не говорит, что значит для него религия: «Я думаю, что это очень личное»[32]. Он не получил христианского воспитания, но всегда интересовался вопросами веры: «Я искал ответы на вопросы о Боге. В 11 лет я даже присоединился ненадолго к группе, изучающей Библию, но это было скучно»[33].\n" +
                "\n" +
                "Несмотря на всю известность Киану Ривза, он часто появляется на улицах грустным и в полном одиночестве. Его можно встретить сидящим на лавочке в парке, пьющим кофе на бетонном бордюре или читающим газету в метро[34][35]. В 2010 году фотография грустного Ривза, поедающего сэндвич, привела к появлению интернет-мема «Грустный Киану». На фанатской страничке актёра в Facebook 15 июня был объявлен «Неофициальным днём поднятия настроения Киану Ривзу»[36]. Свои дни рождения Киану чаще всего отмечает тихо и незаметно. 50-летний юбилей он отметил дома, со своей сестрой[37].\n" +
                "\n" +
                "Фильмография\n" +
                "Год\t\tРусское название\tОригинальное название\tРоль\n" +
                "1984\tс\tУпорство (англ.)русск.\tHangin' In\tпосетитель\n" +
                "1985\tс\tНочная жара\tNight Heat\tграбитель, хулиган\n" +
                "1985\tтф\tОтпуская\tLetting Go\tбезбашенный парень в студии\n" +
                "1985\tс\tФабрика смеха\tComedy Factory\tКрекерс\n" +
                "1985\tкор\tОдин шаг назад\tOne Step Away\tРон Петри\n" +
                "1986\tф\tМолодая кровь\tYoungblood\tХивер\n" +
                "1986\tтф\tАкт возмездия (англ.)русск.\tAct of Vengeance\tБадди Мартин\n" +
                "1986\tс\tДиснейленд (англ.)русск.\tDisneyland\tюный Майк Райли\n" +
                "1986\tф\tПолёт (англ.)русск.\tFlying\tТомми Варнеки\n" +
                "1986\tтф\tБратство справедливости (англ.)русск.\tBrotherhood of Justice\tДерек\n" +
                "1986\tтф\tПод влиянием\tUnder the Influence\tЭдди Толбот\n" +
                "1986\tтф\tДети в стране игрушек\tBabes in Toyland\tДжек\n" +
                "1987\tф\tНа берегу реки\tRiver's Edge\tМэтт\n" +
                "1987\tс\tТяжёлые времена\tTrying Times\tДжоуи\n" +
                "1988\tф\tПрошлой ночью\tThe Night Before\tУинстон Коннелли\n" +
                "1988\tф\tВечная песня\tPermanent Record\tКрис Таунсенд\n" +
                "1988\tф\tПринц Пенсильвании\tThe Prince of Pennsylvania\tРуперт Маршетта\n" +
                "1988\tф\tОпасные связи\tDangerous Liaisons\tШевалье Дансени\n" +
                "1989\tф\tНевероятные приключения Билла и Теда\tBill & Ted's Excellent Adventure\tТед Логан\n" +
                "1989\tс\tАмериканский театр (англ.)русск.\tAmerican Playhouse\tКип\n" +
                "1989\tф\tРодители\tParenthood\tТод Хиггинс\n" +
                "1990\tф\tЯ люблю тебя до смерти\tI Love You to Death\tМарлон Джеймс\n" +
                "1990\tмс\tНевероятные приключения Билла и Теда (англ.)русск.\tBill & Ted's Excellent Adventure\tТед Логан\n" +
                "1990\tф\tНастройся на завтра\tTune in Tomorrow\tМартин Лоудер\n" +
                "1991\tф\tНа гребне волны\tPoint Break\tДжонни Юта\n" +
                "1991\tф\tНовые приключения Билла и Теда\tBill & Ted's Bogus Journey\tТед Логан\n" +
                "1991\tф\tМой личный штат Айдахо\tMy Own Private Idaho\tСкотт Фейвор\n" +
                "1991\tф\tПровиденс\tProvidence\tЭрик\n" +
                "1992\tф\tДракула\tBram Stoker's Dracula\tДжонатан Харкер (англ.)русск.\n" +
                "1993\tф\tМного шума из ничего\tMuch Ado About Nothing\tДон Хуан\n" +
                "1993\tф\tПоэтичная Джастис (англ.)русск.\tPoetic Justice\tбездомный\n" +
                "1993\tф\tОбразина\tFreaked\tчеловек-пёс Ортис\n" +
                "1993\tф\tМаленький Будда\tLittle Buddha\tпринц Сиддхартха / Будда\n" +
                "1994\tф\tДаже девушки-ковбои иногда грустят\tEven Cowgirls Get the Blues\tДжулиан Гитч\n" +
                "1994\tф\tСкорость\tSpeed\tофицер Джек Тревен\n" +
                "1995\tф\tДжонни-мнемоник\tJohnny Mnemonic\tДжонни-мнемоник\n" +
                "1995\tф\tПрогулка в облаках\tA Walk in the Clouds\tсержант Пол Саттон\n" +
                "1996\tф\tЦепная реакция\tChain Reaction\tЭдди Казаливич\n" +
                "1996\tф\tЧувствуя Миннесоту\tFeeling Minnesota\tДжейджекс Клейтон\n" +
                "1997\tф\tСамоубийца (англ.)русск.\tThe Last Time I Committed Suicide\tГарри\n" +
                "1997\tф\tАдвокат дьявола\tThe Devil's Advocate\tКевин Ломакс\n" +
                "1999\tф\tМатрица\tThe Matrix\tТомас Андерсон / Нео\n" +
                "1999\tф\tЯ и Уилл (англ.)русск.\tMe and Will\tв роли самого себя\n" +
                "2000\tф\tДублёры\tThe Replacements\tШейн Фалко\n" +
                "2000\tф\tНаблюдатель\tThe Watcher\tДэвид Аллен Гриффин\n" +
                "2000\tф\tДар\tThe Gift\tДонни Барксдейл\n" +
                "2001\tф\tСладкий ноябрь\tSweet November\tНельсон Мосс\n" +
                "2001\tф\tХардбол\tHardball\tКонор О’Нил\n" +
                "2003\tмф\tАниматрица\tThe Animatrix\tТомас Андерсон / Нео\n" +
                "2003\tф\tМатрица: Перезагрузка\tThe Matrix Reloaded\tТомас Андерсон / Нео\n" +
                "2003\tф\tМатрица: Революция\tThe Matrix Revolutions\tТомас Андерсон / Нео\n" +
                "2003\tф\tЛюбовь по правилам и без\tSomething's Gotta Give\tдоктор Джулиан Мерсер\n" +
                "2005\tф\tКонстантин: Повелитель тьмы\tConstantine\tДжон Константин\n" +
                "2005\tкор\tЭхо\tEcho\tНарцисс\n" +
                "2005\tф\tДурная привычка\tThumbsucker\tПерри Лиман\n" +
                "2005\tф\tЭлли Паркер\tEllie Parker\tв роли самого себя\n" +
                "2006\tф\tДом у озера\tThe Lake House\tАлекс Уайлер\n" +
                "2006\tф\tПомутнение\tA Scanner Darkly\tБоб Арктор\n" +
                "2008\tф\tКороли улиц\tStreet Kings\tдетектив Том Ладлоу\n" +
                "2008\tф\tДень, когда Земля остановилась\tThe Day the Earth Stood Still\tКлаату (англ.)русск.\n" +
                "2009\tф\tЧастная жизнь Пиппы Ли\tThe Private Lives of Pippa Lee\tКрис Надо\n" +
                "2009\tс\tЛёгкая сборка (англ.)русск.\tEasy to Assemble\tВорст Феррон\n" +
                "2009\tс\tЗвезда Болливуда (англ.)русск.\tBollywood Hero\tв роли самого себя\n" +
                "2011\tф\tКриминальная фишка от Генри\tHenry's Crime\tГенри Торн\n" +
                "2012\tф\tТрое в Нью-Йорке (англ.)русск.\tGeneration Um...\tДжон Уолл\n" +
                "2013\tф\tМастер тай-цзи\tMan of Tai Chi\tДонака Марк\n" +
                "2013\tф\t47 ронинов\t47 Ronin\tКай\n" +
                "2014\tф\tДжон Уик\tJohn Wick\tДжон Уик\n" +
                "2015\tф\tКто там\tKnock Knock\tЭван Уэббер\n" +
                "2016\tф\tДочь Бога (англ.)русск.\tExposed\tдетектив Скотт Галбан\n" +
                "2016\tф\tКиану (англ.)русск.\tKeanu\tКиану\n" +
                "2016\tф\tТолько правда (англ.)русск.\tThe Whole Truth\tРичард Рэмси\n" +
                "2016\tф\tНеоновый демон\tThe Neon Demon\tХэнк\n" +
                "2016—2018\tс\tШведские стволы (англ.)русск.\tSwedish Dicks\tТэкс Джонсон\n" +
                "2017\tф\tПлохая партия\tThe Bad Batch\tРокуэлл\n" +
                "2017\tф\tДжон Уик 2\tJohn Wick: Chapter 2\tДжон Уик\n" +
                "2017\tф\tДо костей\tTo the Bone\tдоктор Уильям Бекхэм\n" +
                "2017\tф\tПроисшествие монументального масштаба (англ.)русск.\tA Happening of Monumental Proportions\tБоб\n" +
                "2017\tф\tSPF-18 (англ.)русск.\tSPF-18\tв роли самого себя\n" +
                "2018\tф\tКак женить холостяка\tDestination Wedding\tФрэнк\n" +
                "2018\tф\tРепродукция\tReplicas\tУилл Фостер\n" +
                "2018\tф\tПрофессионал\tSiberia\tЛукас Хилл\n" +
                "2019\tф\tДжон Уик 3\tJohn Wick: Chapter 3 — Parabellum\tДжон Уик\n" +
                "2019\tф\tТы — моё сомнение\tAlways Be My Maybe\tв роли самого себя\n" +
                "2019\tмф\tИстория игрушек 4\tToy Story 4\tДюк Кабум\n" +
                "2019\tф\tМежду двумя папоротниками (англ.)русск.\tBetween Two Ferns: The Movie\tв роли самого себя\n" +
                "2020\tмф\tГубка Боб в бегах\tThe SpongeBob Movie: Sponge on the Run\tМудрец\n" +
                "2020\tф\tБилл и Тед снова в деле\tBill & Ted Face the Music\tТед Логан\n" +
                "2021\tф\tМатрица 4\n" +
                "(постпроизводство)\tMatrix\tТомас Андерсон / Нео\n" +
                "Компьютерные игры\n" +
                "2003 — Enter the Matrix — Нео — живые кат-сцены\n" +
                "2020 — Cyberpunk 2077 — Джонни Сильверхенд — голос, захват движения\n" +
                "За кадром\n" +
                "2011 — Криминальная фишка от Генри / Henry’s Crime — продюсер\n" +
                "2012 — Бок о бок / Side by Side — продюсер\n" +
                "2013 — Мастер тай-цзи / Man of Tai Chi — режиссёр\n" +
                "2015 — Кто там / Knock Knock — исполнительный продюсер\n" +
                "2016 — Дочь Бога (англ.)русск. / Exposed — продюсер\n" +
                "2018 — Репродукция / Replicas — продюсер\n" +
                "2018 — Профессионал / Siberia — продюсер\n" +
                "2019 — Зелёный дельфин (англ.)русск. / Already Gone — исполнительный продюсер\n" +
                "2019 — Салация / Salacia (короткометражный фильм) — исполнительный продюсер\n" +
                "Награды и номинации\n" +
                "Полный список наград и номинаций на сайте IMDb.com[38]\n" +
                "\n" +
                "Награды\n" +
                "1991: Кинонаграда канала MTV, Самый желанный мужчина («На гребне волны»)\n" +
                "1994: Кинонаграда канала MTV, Лучший экранный дуэт («Скорость»)\n" +
                "2000: Премия «Blockbuster Entertainment Award», Лучший актёр в жанре экшн («Матрица»)\n" +
                "2000: Премия «Golden Slate», Лучший актёр («Матрица»)\n" +
                "2000: Кинонаграда канала MTV, Лучшая мужская роль («Матрица»)\n" +
                "2004: Премия «World Stunt Awards», Почётная награда Лучшему актёру (за исполнение трюков в фильмах «Матрица: Перезагрузка» и «Матрица: Революция»)\n" +
                "2006: Премия «Teen Choice Award», Лучшая экранная пара («Дом у озера»)\n" +
                "2008: Премия «Bambi», Лучший зарубежный актёр (после фильма «Короли улиц»)\n" +
                "Номинации\n" +
                "1994: Премия «Blimp Award», Лучшая мужская роль («Скорость»)\n" +
                "1994: Кинонаграда канала MTV, Лучший поцелуй («Скорость»)\n" +
                "1994: Кинонаграда канала MTV, Лучшая мужская роль («Скорость»)\n" +
                "1994: Кинонаграда канала MTV, Самый желанный мужчина («Скорость»)\n" +
                "1995: Кинонаграда канала MTV, Лучший поцелуй («Прогулка в облаках»)\n" +
                "1995: Кинонаграда канала MTV, Самый желанный мужчина («Прогулка в облаках»)\n" +
                "2000: Премия «Сатурн», Лучший актёр («Матрица»)\n" +
                "2000: Кинонаграда канала MTV, Лучший экранный дуэт («Матрица»)\n" +
                "2003: Премия «Teen Choice Award», Лучший актёр — Драма / Экшн («Матрица: Перезагрузка»)\n" +
                "2004: Кинонаграда канала MTV, Лучшая драка («Матрица: Перезагрузка»)\n" +
                "2004: Кинонаграда канала MTV, Лучший поцелуй («Матрица: Перезагрузка»)\n" +
                "2004: Кинонаграда канала MTV, Самый сексуальный супергерой («Матрица: Перезагрузка»)\n" +
                "2004: Премия «Taurus Award», Лучший актёр — Драма / Экшн / Приключения («Матрица: Революция»)\n" +
                "2004: Премия «Teen Choice Award», Лучший поединок («Матрица: Революция»)\n" +
                "Антипремия\n" +
                "Актёр является одним из «лидеров» антипремии «Золотая малина», получив номинацию в категории «Худший неудачник за первые 25 лет».\n" +
                "\n" +
                "Прим. — в разделе таблицы «год» ссылки выставлены на соответствующую церемонию премии.\n" +
                "\n" +
                "№\tГод\tФильм\tКатегория\tРезультат\n" +
                "1\t1994\tМного шума из ничего\tХудшая мужская роль второго плана\tНоминация\n" +
                "2\t1996\tДжонни-мнемоник\tХудшая мужская роль\tНоминация\n" +
                "Прогулка в облаках\tНоминация\n" +
                "3\t1997\tЦепная реакция\tНоминация\n" +
                "4\t2001\tНаблюдатель\tХудшая мужская роль второго плана\tНоминация\n" +
                "5\t2002\tХардбол\tХудшая мужская роль\tНоминация\n" +
                "Сладкий ноябрь\tНоминация\n" +
                "6\t2005\t\tХудший неудачник за первые 25 лет\tНоминация\n" +
                "7\t2015\tДжон Уик\tПриз за восстановление репутации\tНоминация\n" +
                "Примечания\n" +
                "↑ Показывать компактно\n" +
                " Keanu Reeves // Munzinger Archiv (нем.) — 1913.\n" +
                " Keanu Charles Reeves // Энциклопедия Брокгауз (нем.)\n" +
                " Keanu Reeves // GeneaStar\n" +
                " Janet Maslin. Review/Film; Surf's Up For F.B.I. In Bigelow's 'Point Break' (англ.). nytimes.com (12 July 1991). Дата обращения: 14 января 2017.\n" +
                " Keanu Reeves | Hollywood Walk of Fame (англ.). www.walkoffame.com. Дата обращения: 10 февраля 2017.\n" +
                " Keanu Reeves Biography (1964-) (англ.). www.filmreference.com. Дата обращения: 10 февраля 2017.\n" +
                " Keanu Reeves: The three billion dollar man, Mail Online. Дата обращения 10 февраля 2017.\n" +
                " The Hottest Unproduced Screenplays of 2007 - /Film (англ.), Slashfilm (9 December 2007). Дата обращения 10 февраля 2017.\n" +
                " Editorial, Reuters. Reeves leads cast of futuristic \"Bebop\" (англ.), Reuters UK. Дата обращения 10 февраля 2017.\n" +
                " Siegel, Tatiana. Keanu Reeves set for ‘Bebop’ (англ.), Variety (15 January 2009). Архивировано 13 ноября 2012 года. Дата обращения 10 февраля 2017.\n" +
                " Keslassy, Elsa. Keanu Reeves, Christina Hendricks Join Cast of Nicolas Refn’s ‘The Neon Demon’ (англ.), Variety (5 February 2015). Дата обращения 10 февраля 2017.\n" +
                " John Wick (англ.). Дата обращения: 10 февраля 2017.\n" +
                " John Wick: Chapter 2 (англ.). Дата обращения: 10 февраля 2017.\n" +
                " Keanu Reeves confirms that 'Bill And Ted 3' is on the way - NME (англ.), NME (6 April 2011). Дата обращения 10 февраля 2017.\n" +
                " GameSpot. Cyberpunk 2077 - Keanu Reeves On Stage | Microsoft Xbox E3 2019 (9 июня 2019). Дата обращения: 10 июня 2019.\n" +
                " Зритель брифинга Xbox, назвавший Киану Ривза сногсшибательным, получит коллекционку Cyberpunk 2077. Игромания. Шевкун, Михаил (10 июня 2019). Дата обращения: 11 июня 2019.\n" +
                " Keanu Reeves just announced to the world that I’m breathtaking. Twitter. Peter “Breathtaking” Sark (9 июня 2019). Дата обращения: 11 июня 2019.\n" +
                " The Pre-Production #3 – ‘Mortal Kombat’, ‘The Matrix 4’, ‘Venom 2’, ‘Lizzie McGuire’, ‘Birds Of Prey’, Discussing Film (5 сентября 2019). Дата обращения 8 сентября 2019.\n" +
                " Arch Motorcycle. Подробнее. Facebook. Дата обращения: 24 апреля 2013.\n" +
                " f2szilard666. Dogstar @ Jay Leno (24 января 2011). Дата обращения: 17 февраля 2017.\n" +
                " luriette78. Keanu Reeves band Becky's 2nd time on Sharon Osbourne (9 августа 2008). Дата обращения: 17 февраля 2017.\n" +
                " Has Keanu finally found love? Reeves and mystery woman enjoy dinner date in London, Mail Online. Дата обращения 10 февраля 2017.\n" +
                " A. B. C. News. Film Notes: Keanu Reeves' Girlfriend Killed. ABC News (6 января 2006). Дата обращения: 10 февраля 2017.\n" +
                " Too Much Sorrow – Vol. 55 No. 16 (англ.), PEOPLE.com (23 April 2001). Дата обращения 10 февраля 2017.\n" +
                " Инсайдеры об отношениях Киану Ривза и Александры Грант: «Она помогла ему пережить смерть его экс-возлюбленной»\n" +
                " Keanu courts humor against paparazzo (англ.), NY Daily News. Дата обращения 10 февраля 2017.\n" +
                " Paparazzo says Reeves hit him with car - USATODAY.com. www.usatoday.com. Дата обращения: 10 февраля 2017.\n" +
                " Ryan, Harriet. Reeves cleared in paparazzo lawsuit (англ.), Los Angeles Times (4 November 2008). Дата обращения 10 февраля 2017.\n" +
                " Keanu 'still an atheist', News24. Дата обращения 10 февраля 2017.\n" +
                " Page Not Found. w3.newsmax.com. Дата обращения: 10 февраля 2017.\n" +
                " Sure I believe in God and the Devil but they don't have to have pitchforks and a long white beard. (ноябрь 1997).\n" +
                " Please don’t. I think it’s personal and private. I like the flesh and blood aspect like I said earlier..\n" +
                " In my life I have searched for and asked about God. I joined a Bible group for a bit when I was 11 but it was boring..\n" +
                " milanetzzz. Киану Ривз в Метро Нью-Йорка. YouTube (10 декабря 2011). Дата обращения: 14 января 2017.\n" +
                " Антон Городецкий. Киану Ривз: «Я люблю быть один, но стараюсь не быть одиноким, потому что последнее просто невыносимо». maximonline.ru (январь 2014). Дата обращения: 14 января 2017.\n" +
                " Claire Suddath. Help Cheer Up Keanu Reeves, Time Magazine (15 июня 2010).\n" +
                " Зайцев Макар. Киану Ривз: Я наигрался со смертью после потери близких. sobesednik.ru (7 декабря 2014). Дата обращения: 14 января 2017.\n" +
                " Keanu Reeves Awards. IMDb. Дата обращения: 1 апреля 2017.\n" +
                "Ссылки\n" +
                "⚙️   Тематические сайты\n" +
                "AllMovie · AllMusic · AlloCiné · ČSFD · Датская национальная фильмография · Discogs · Internet Movie Database · КиноПоиск · Metacritic · MovieMeter · MusicBrainz · Rotten Tomatoes · Giant Bomb\n" +
                "Словари и энциклопедии\t\n" +
                "Большая каталанская · Большая норвежская · Канадская · Brockhaus · Notable Names Database · Treccani\n" +
                "[показать]\n" +
                "Нормативный контроль\n" +
                "[показать]⛭\n" +
                "Кинонаграда MTV за лучшее исполнение в кино\n" +
                "[показать]⛭\n" +
                "Кинонаграда MTV за лучший бой\n" +
                "Категории: Родившиеся 2 сентябряРодившиеся в 1964 годуРодившиеся в БейрутеПерсоналии по алфавитуАктёры по алфавитуАктёры XX векаАктёры XXI векаАктёры телевидения КанадыАктёры озвучивания КанадыКинопродюсеры по алфавитуКинопродюсеры XXI векаКинопродюсеры КанадыЛауреаты MTV Movie & TV AwardsБас-гитаристы по алфавитуБас-гитаристы XX векаБас-гитаристы XXI векаБас-гитаристы КанадыМузыканты альтернативного рокаЛюди с дислексиейГолливудская «Аллея славы»Киноактёры Канады\n" +
                "Навигация\n" +
                "Вы не представились системе\n" +
                "Обсуждение\n" +
                "Вклад\n" +
                "Создать учётную запись\n" +
                "Войти\n" +
                "СтатьяОбсуждение\n" +
                "ЧитатьПравитьПравить кодИсторияПоиск\n" +
                "Искать в Википедии\n" +
                "Заглавная страница\n" +
                "Рубрикация\n" +
                "Указатель А — Я\n" +
                "Избранные статьи\n" +
                "Случайная страница\n" +
                "Текущие события\n" +
                "Участие\n" +
                "Сообщить об ошибке\n" +
                "Сообщество\n" +
                "Форум\n" +
                "Свежие правки\n" +
                "Новые страницы\n" +
                "Справка\n" +
                "Пожертвовать\n" +
                "Инструменты\n" +
                "Ссылки сюда\n" +
                "Связанные правки\n" +
                "Служебные страницы\n" +
                "Постоянная ссылка\n" +
                "Сведения о странице\n" +
                "Цитировать страницу\n" +
                "Печать/экспорт\n" +
                "Создать книгу\n" +
                "Скачать как PDF\n" +
                "Версия для печати\n" +
                "В других проектах\n" +
                "Викисклад\n" +
                "Викиновости\n" +
                "Викицитатник\n" +
                "Элемент Викиданных\n" +
                "\n" +
                "На других языках\n" +
                "Azərbaycanca\n" +
                "English\n" +
                "Suomi\n" +
                "हिन्दी\n" +
                "Հայերեն\n" +
                "Монгол\n" +
                "Српски / srpski\n" +
                "Татарча/tatarça\n" +
                "中文\n" +
                "Ещё 88\n" +
                "Править ссылки\n" +
                "Эта страница в последний раз была отредактирована 23 апреля 2021 в 10:09.\n" +
                "Текст доступен по лицензии Creative Commons Attribution-ShareAlike; в отдельных случаях могут действовать дополнительные условия. Подробнее см. Условия использования.\n" +
                "Wikipedia® — зарегистрированный товарный знак некоммерческой организации Wikimedia Foundation, Inc.\n" +
                "Политика конфиденциальностиОписание ВикипедииОтказ от ответственностиСвяжитесь с намиМобильная версияРазработчикиСтатистикаЗаявление о кукиWikimedia FoundationPowered by MediaWiki";
        String[] strings = s.split(" ");

        CountableBloomFilter countableBloomFilter = new CountableBloomFilter(0.0001, strings.length);
        for (int i = 0; i < strings.length; i++){
            countableBloomFilter.addValue(strings[i]);
        }

        System.out.println(countableBloomFilter.contains("Молоко"));
        System.out.println(countableBloomFilter.contains("Творог"));

        countableBloomFilter.addValue("Молоко");
        System.out.println(countableBloomFilter.contains("Молоко"));

        countableBloomFilter.addValue("Творог");
        countableBloomFilter.addValue("Машина");
        countableBloomFilter.addValue("Данные");
        countableBloomFilter.addValue("ИТИС");
        countableBloomFilter.addValue("Портфель");
        countableBloomFilter.addValue("была");
        countableBloomFilter.addValue("товарный");
        countableBloomFilter.addValue("страница");
        countableBloomFilter.addValue("Связанные");


        System.out.println("-------------------------------------");
        System.out.println(countableBloomFilter.contains(("Творог")));
        System.out.println(countableBloomFilter.contains(("Машина")));
        System.out.println(countableBloomFilter.contains(("Данные")));
        System.out.println(countableBloomFilter.contains(("ИТИС")));
        System.out.println(countableBloomFilter.contains(("Портфель")));
        System.out.println(countableBloomFilter.contains(("была")));
        System.out.println(countableBloomFilter.contains(("товарный")));
        System.out.println(countableBloomFilter.contains(("страница")));
        System.out.println(countableBloomFilter.contains(("Связанные")));
        countableBloomFilter.delete("Связанные");
        System.out.println(countableBloomFilter.contains(("Связанные")));


    }
}
